;
/*加载左侧悬停菜单*/
! function (){
	var data = '{"clothes":['+
	'{"title":"女装","value":["羽绒服","毛呢外套","毛衣","针织衫","棉服","连衣裙","气场外套","风衣","裤子","卫衣","T恤","阔腿裤","衬衫","牛仔裤","半身裙","大码女装","时尚套装","西装","打底衫","夹克","皮衣","皮草","妈妈装","民族舞台","腔调","私服名媛","甜美风","文艺风","街头风","原创","通勤风","婚纱礼服"]},'+
	'{"title":"男装","value":["潮牌馆","原创设计","风格好店","T恤","衬衫","夹克","外套","卫衣","明星网红","休闲裤","牛仔裤","风衣","西装","牛仔外套","棒球服","针织衫","运动外套","运动裤","九分裤","专柜大牌","POLO衫","皮衣","套装","穿搭攻略","开衫","马甲","呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风"]},'+
	'{"title":"内衣","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]}'+
	'],'+
	'"shoes":['+
	'{"title":"鞋靴","value":["女鞋","红人同款","夏上新","帆布鞋","小皮鞋","一脚蹬","松糕厚底","平底鞋","低跟","中跟","高跟","穆勒鞋","复古方头","尖头","小粗跟","细跟","男鞋","休闲鞋","板鞋","帆布鞋","运动风","豆豆鞋","乐福鞋","雕花布洛克","船鞋","增高鞋","正装商务","户外休闲","爸爸鞋","德比鞋","孟克鞋","布鞋"]},'+				
	'{"title":"箱包","value":["春季新品","女包","骚包","双肩包","男包","旅行箱","钱包","真皮包","大牌","宽肩带","小方包","水桶包","迷你包","链条包","贝壳包","波士顿包","手拿包","单肩包","手提包","斜挎包","零钱包","妈妈包","欧美潮搭","日韩流行","青春学院","男士商务","雅痞休闲","拉杆箱","腰包","胸包"]},'+
	'{"title":"配件配饰","value":["帽子","针织帽","贝雷帽","渔夫帽","鸭舌帽","礼帽","毛线帽","套头帽","爵士帽","盆帽","八角帽","围巾","羊绒围巾","披肩","羊毛围巾","真丝围巾","棉麻围巾","方巾","皮草围巾","羊绒羊毛混纺围巾","羊毛棉混纺围巾","手套","真皮手套","触屏手套","半指手套","全指手套","毛线手套","真皮腰带"]}'+
	'],'+
	'"baby":['+
	'{"title":"童装玩具","value":["连衣裙","保暖连体","裤子","羽绒","居家睡衣","针织","帽子","亲子装","童鞋","学步鞋","女童运动鞋","男童运动鞋","毛毛虫童鞋","雪地靴","马丁靴","长靴","玩具","积木","毛绒玩具","早教","儿童自行车","电动童车","遥控模型","户外玩具","亲子玩具","学习用品","描红本"]},'+
	'{"title":"孕产用品","value":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"]},'+
	'{"title":"奶粉辅食","value":["爱他美","羊奶粉","特殊配方奶粉","喜宝","惠氏","启赋","牛栏","美素佳儿","贝因美","雅培","美赞臣","可瑞康","a2","嘉宝","美林","米粉","泡芙","溶溶豆","肉肠","果肉条","奶片","益生菌","维生素","钙铁锌","DHA","宝宝食用油","核桃油","葡萄糖","宝宝调料","奶瓶","餐具","餐椅","暖奶器"]}'+
	'],'+
	'"hea":['+
	'{"title":"家电","value":["淘宝速达","实体商场服务","淘火炬品牌","生活电器","厨房电器","个人护理","空气净化器","扫地机器人","吸尘器","取暖器","烤箱","豆浆机","榨汁料理","电饭煲","吹风机","足浴盆","剃须刀","卷发器","按摩器材","冬季火锅","蓝牙耳机","电暖桌","蓝牙音箱","电热毯","加湿器","暖风机"]},'+
	'{"title":"数码","value":["淘宝速达","淘宝火炬品牌","实体商场服务","2小时送货服务","surface平板电脑","苹果/Apple","iPad","Pro","电脑主机","数码相机","电玩动漫","单反相机","华为","MateBook","IPAD","mini4","游戏主机","鼠标键盘","无人机","二手数码","二手手机","二手笔记本","二手平板电脑"]},'+
	'{"title":"手机","value":["淘宝速达","实体商场服务","iPhoneX","iPhone8","iphone 7 plus","iphone 6s","iphone 7","华为mate9","苹果6S","苹果6 plus","荣耀","三星","三星s7","小米","红米note3","华为mate8","魅族","oppo","vivo"]}'+
	'],'+
	'"cos":['+
	'{"title":"美妆","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]},'+
	'{"title":"个人护理","value":["帽子","针织帽","贝雷帽","渔夫帽","鸭舌帽","礼帽","毛线帽","套头帽","爵士帽","盆帽","八角帽","围巾","羊绒围巾","披肩","羊毛围巾","真丝围巾","棉麻围巾","方巾","皮草围巾","羊绒羊毛混纺围巾","羊毛棉混纺围巾","手套","真皮手套","触屏手套","半指手套","全指手套","毛线手套","真皮腰带"]},'+
	'{"title":"营养保健","value":["连衣裙","保暖连体","裤子","羽绒","居家睡衣","针织","帽子","亲子装","童鞋","学步鞋","女童运动鞋","男童运动鞋","毛毛虫童鞋","雪地靴","马丁靴","长靴","玩具","积木","毛绒玩具","早教","儿童自行车","电动童车","遥控模型","户外玩具","亲子玩具","学习用品","描红本"]}'+
	'],'+
	'"jewel":['+
	'{"title":"珠宝","value":["女鞋","红人同款","夏上新","帆布鞋","小皮鞋","一脚蹬","松糕厚底","平底鞋","低跟","中跟","高跟","穆勒鞋","复古方头","尖头","小粗跟","细跟","男鞋","休闲鞋","板鞋","帆布鞋","运动风","豆豆鞋","乐福鞋","雕花布洛克","船鞋","增高鞋","正装商务","户外休闲","爸爸鞋","德比鞋","孟克鞋","布鞋"]},'+
	'{"title":"眼镜","value":["淘宝速达","淘宝火炬品牌","实体商场服务","2小时送货服务","surface平板电脑","苹果/Apple","iPad","Pro","电脑主机","数码相机","电玩动漫","单反相机","华为","MateBook","IPAD","mini4","游戏主机","鼠标键盘","无人机","二手数码","二手手机","二手笔记本","二手平板电脑"]},'+
	'{"title":"手表","value":["连衣裙","保暖连体","裤子","羽绒","居家睡衣","针织","帽子","亲子装","童鞋","学步鞋","女童运动鞋","男童运动鞋","毛毛虫童鞋","雪地靴","马丁靴","长靴","玩具","积木","毛绒玩具","早教","儿童自行车","电动童车","遥控模型","户外玩具","亲子玩具","学习用品","描红本"]}'+
	'],'+
	'"sport":['+
	'{"title":"运动","value":["潮牌馆","原创设计","风格好店","T恤","衬衫","夹克","外套","卫衣","明星网红","休闲裤","牛仔裤","风衣","西装","牛仔外套","棒球服","针织衫","运动外套","运动裤","九分裤","专柜大牌","POLO衫","皮衣","套装","穿搭攻略","开衫","马甲","呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风"]},'+
	'{"title":"户外健身","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]},'+
	'{"title":"乐器","value":["帽子","针织帽","贝雷帽","渔夫帽","鸭舌帽","礼帽","毛线帽","套头帽","爵士帽","盆帽","八角帽","围巾","羊绒围巾","披肩","羊毛围巾","真丝围巾","棉麻围巾","方巾","皮草围巾","羊绒羊毛混纺围巾","羊毛棉混纺围巾","手套","真皮手套","触屏手套","半指手套","全指手套","毛线手套","真皮腰带"]}'+
	'],'+
	'"game":['+
	'{"title":"游戏","value":["连衣裙","保暖连体","裤子","羽绒","居家睡衣","针织","帽子","亲子装","童鞋","学步鞋","女童运动鞋","男童运动鞋","毛毛虫童鞋","雪地靴","马丁靴","长靴","玩具","积木","毛绒玩具","早教","儿童自行车","电动童车","遥控模型","户外玩具","亲子玩具","学习用品","描红本"]},'+
	'{"title":"动漫周边","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]},'+
	'{"title":"热门影视周边","value":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"]}'+
	'],'+
	'"sport":['+
	'{"title":"运动","value":["淘宝速达","淘宝火炬品牌","实体商场服务","2小时送货服务","surface平板电脑","苹果/Apple","iPad","Pro","电脑主机","数码相机","电玩动漫","单反相机","华为","MateBook","IPAD","mini4","游戏主机","鼠标键盘","无人机","二手数码","二手手机","二手笔记本","二手平板电脑"]},'+
	'{"title":"户外健身","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]},'+
	'{"title":"乐器","value":["潮牌馆","原创设计","风格好店","T恤","衬衫","夹克","外套","卫衣","明星网红","休闲裤","牛仔裤","风衣","西装","牛仔外套","棒球服","针织衫","运动外套","运动裤","九分裤","专柜大牌","POLO衫","皮衣","套装","穿搭攻略","开衫","马甲","呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风"]}'+
	'],'+
	'"food":['+
	'{"title":"美食","value":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"]},'+
	'{"title":"生鲜","value":["连衣裙","保暖连体","裤子","羽绒","居家睡衣","针织","帽子","亲子装","童鞋","学步鞋","女童运动鞋","男童运动鞋","毛毛虫童鞋","雪地靴","马丁靴","长靴","玩具","积木","毛绒玩具","早教","儿童自行车","电动童车","遥控模型","户外玩具","亲子玩具","学习用品","描红本"]},'+
	'{"title":"零食","value":["帽子","针织帽","贝雷帽","渔夫帽","鸭舌帽","礼帽","毛线帽","套头帽","爵士帽","盆帽","八角帽","围巾","羊绒围巾","披肩","羊毛围巾","真丝围巾","棉麻围巾","方巾","皮草围巾","羊绒羊毛混纺围巾","羊毛棉混纺围巾","手套","真皮手套","触屏手套","半指手套","全指手套","毛线手套","真皮腰带"]}'+
	'],'+
	'"flower":['+
	'{"title":"鲜花园艺","value":["淘宝速达","淘宝火炬品牌","实体商场服务","2小时送货服务","surface平板电脑","苹果/Apple","iPad","Pro","电脑主机","数码相机","电玩动漫","单反相机","华为","MateBook","IPAD","mini4","游戏主机","鼠标键盘","无人机","二手数码","二手手机","二手笔记本","二手平板电脑"]},'+
	'{"title":"宠物水族","value":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"]},'+
	'{"title":"农资","value":["潮牌馆","原创设计","风格好店","T恤","衬衫","夹克","外套","卫衣","明星网红","休闲裤","牛仔裤","风衣","西装","牛仔外套","棒球服","针织衫","运动外套","运动裤","九分裤","专柜大牌","POLO衫","皮衣","套装","穿搭攻略","开衫","马甲","呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风"]}'+
	'],'+
	'"house":['+
	'{"title":"房产","value":["连衣裙","保暖连体","裤子","羽绒","居家睡衣","针织","帽子","亲子装","童鞋","学步鞋","女童运动鞋","男童运动鞋","毛毛虫童鞋","雪地靴","马丁靴","长靴","玩具","积木","毛绒玩具","早教","儿童自行车","电动童车","遥控模型","户外玩具","亲子玩具","学习用品","描红本"]},'+
	'{"title":"装修","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]},'+
	'{"title":"建材","value":["女鞋","红人同款","夏上新","帆布鞋","小皮鞋","一脚蹬","松糕厚底","平底鞋","低跟","中跟","高跟","穆勒鞋","复古方头","尖头","小粗跟","细跟","男鞋","休闲鞋","板鞋","帆布鞋","运动风","豆豆鞋","乐福鞋","雕花布洛克","船鞋","增高鞋","正装商务","户外休闲","爸爸鞋","德比鞋","孟克鞋","布鞋"]}'+
	'],'+
	'"furniture":['+
	'{"title":"家具","value":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"]},'+
	'{"title":"布艺软饰","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]},'+
	'{"title":"床上用品","value":["淘宝速达","淘宝火炬品牌","实体商场服务","2小时送货服务","surface平板电脑","苹果/Apple","iPad","Pro","电脑主机","数码相机","电玩动漫","单反相机","华为","MateBook","IPAD","mini4","游戏主机","鼠标键盘","无人机","二手数码","二手手机","二手笔记本","二手平板电脑"]}'+
	'],'+
	'"car":['+
	'{"title":"品质汽车","value":["潮牌馆","原创设计","风格好店","T恤","衬衫","夹克","外套","卫衣","明星网红","休闲裤","牛仔裤","风衣","西装","牛仔外套","棒球服","针织衫","运动外套","运动裤","九分裤","专柜大牌","POLO衫","皮衣","套装","穿搭攻略","开衫","马甲","呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风"]},'+
	'{"title":"二手车","value":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"]},'+
	'{"title":"汽车用品","value":["女鞋","红人同款","夏上新","帆布鞋","小皮鞋","一脚蹬","松糕厚底","平底鞋","低跟","中跟","高跟","穆勒鞋","复古方头","尖头","小粗跟","细跟","男鞋","休闲鞋","板鞋","帆布鞋","运动风","豆豆鞋","乐福鞋","雕花布洛克","船鞋","增高鞋","正装商务","户外休闲","爸爸鞋","德比鞋","孟克鞋","布鞋"]}'+
	'],'+
	'"office":['+
	'{"title":"办公","value":["女鞋","红人同款","夏上新","帆布鞋","小皮鞋","一脚蹬","松糕厚底","平底鞋","低跟","中跟","高跟","穆勒鞋","复古方头","尖头","小粗跟","细跟","男鞋","休闲鞋","板鞋","帆布鞋","运动风","豆豆鞋","乐福鞋","雕花布洛克","船鞋","增高鞋","正装商务","户外休闲","爸爸鞋","德比鞋","孟克鞋","布鞋"]},'+
	'{"title":"DIY","value":["淘宝速达","实体商场服务","淘火炬品牌","生活电器","厨房电器","个人护理","空气净化器","扫地机器人","吸尘器","取暖器","烤箱","豆浆机","榨汁料理","电饭煲","吹风机","足浴盆","剃须刀","卷发器","按摩器材","冬季火锅","蓝牙耳机","电暖桌","蓝牙音箱","电热毯","加湿器","暖风机"]},'+
	'{"title":"五金/电子","value":["潮牌馆","原创设计","风格好店","T恤","衬衫","夹克","外套","卫衣","明星网红","休闲裤","牛仔裤","风衣","西装","牛仔外套","棒球服","针织衫","运动外套","运动裤","九分裤","专柜大牌","POLO衫","皮衣","套装","穿搭攻略","开衫","马甲","呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风"]}'+
	'],'+
	'"mail":['+
	'{"title":"百货","value":["帽子","针织帽","贝雷帽","渔夫帽","鸭舌帽","礼帽","毛线帽","套头帽","爵士帽","盆帽","八角帽","围巾","羊绒围巾","披肩","羊毛围巾","真丝围巾","棉麻围巾","方巾","皮草围巾","羊绒羊毛混纺围巾","羊毛棉混纺围巾","手套","真皮手套","触屏手套","半指手套","全指手套","毛线手套","真皮腰带"]},'+
	'{"title":"餐厨","value":["美妈大衣","孕妇裤","月子服","哺乳文胸","吸奶器","防辐射","孕妇内裤","连衣裙","待产包","孕妇牛仔裤","孕妇营养品","防溢乳垫","美德乐","十月妈咪","三洋","Bravado","新生儿","婴儿床","婴儿推车","睡袋","抱被","隔尿垫","学步车","安抚奶嘴","体温计","纸尿裤","花王","洗衣液","湿巾"]},'+
	'{"title":"家庭保健","value":["保暖内衣","丝绒睡衣","内裤女","文胸","内裤男","长袖睡衣","珊瑚绒睡衣","夹棉睡衣","长筒袜","棉袜","情侣睡衣","秋裤","保暖背心","睡袍","男士睡衣","塑身衣","内衣套装","打底裤","连体睡衣","睡裙女冬","聚拢文胸","男士袜子","棉袜女","卡通睡衣"]}'+
	'],'+
	'"study":['+
	'{"title":"学习","value":["潮牌馆","原创设计","风格好店","T恤","衬衫","夹克","外套","卫衣","明星网红","休闲裤","牛仔裤","风衣","西装","牛仔外套","棒球服","针织衫","运动外套","运动裤","九分裤","专柜大牌","POLO衫","皮衣","套装","穿搭攻略","开衫","马甲","呢大衣","羽绒服","棉衣","中老年","情侣装","大码","民族风"]},'+
	'{"title":"卡劵票","value":["女鞋","红人同款","夏上新","帆布鞋","小皮鞋","一脚蹬","松糕厚底","平底鞋","低跟","中跟","高跟","穆勒鞋","复古方头","尖头","小粗跟","细跟","男鞋","休闲鞋","板鞋","帆布鞋","运动风","豆豆鞋","乐福鞋","雕花布洛克","船鞋","增高鞋","正装商务","户外休闲","爸爸鞋","德比鞋","孟克鞋","布鞋"]},'+
	'{"title":"本地服务","value":["淘宝速达","实体商场服务","淘火炬品牌","生活电器","厨房电器","个人护理","空气净化器","扫地机器人","吸尘器","取暖器","烤箱","豆浆机","榨汁料理","电饭煲","吹风机","足浴盆","剃须刀","卷发器","按摩器材","冬季火锅","蓝牙耳机","电暖桌","蓝牙音箱","电热毯","加湿器","暖风机"]}'+
	']}';
	var name = ["随机名字01女装","随机名字02男装","手机大屏高颜值","高性价比，高品质","无以伦比的好","用过都说美","超低价超靓","好地段好位置","oppo-vivo-honor","iphone-x超感动"];
	var menu = document.getElementsByClassName('menu-left')[0];
	var selcect = menu.getElementsByTagName('ul');
	var menuList = menu.getElementsByClassName('menu-list')[0];
	var list = menuList.getElementsByClassName('list')[0];
	var title = list. getElementsByClassName('title');
	var listContent = list.getElementsByClassName('list-content');	
	var love = menuList.getElementsByClassName('you-love')[0];
	var loveImg = love.getElementsByTagName('img');
	var loveImgName = love.getElementsByTagName('p');
	var href = JSON.parse(data);
	for(var i = 0 ;i < selcect.length ; i++){
		selcect[i].addEventListener('mouseover',function(){			
			var className = this.className;
			var group =  href[className] ;
			for(var j = 0 ; j < group.length;j++){
				title[j].innerHTML = '';
				listContent[j].innerHTML = '';
				title[j].innerHTML =  group[j].title ;
				var value = group[j].value;
				for(var k = 0 ; k < value.length; k++){					
					var link = document.createElement("a");
					var text = document.createTextNode(value[k]);
					if(Math.random()*10 >8 ){
						link.className = 'color-tb';
					}
					link.appendChild(text);
					listContent[j].appendChild(link) ;
				}
			}

			for(var s = 0 ; s < loveImg.length ; s++){
				var num = Math.ceil(Math.random()*14);
				loveImg[s].src = "./img/love"+num+".jpg_.webp";
				var imgName = name[Math.floor(Math.random()*name.length)];
				loveImgName[s].innerHTML = imgName;
			}
		});
	}
}();
